class OrderData():
    ORDER_DATA_1 = {
            "name": "Иван",
            "surname": "Иванов",
            "address": "Москва, ул. Пушкина, 999",
            "phone": "+79876543210",
            "delivery_date": "12.12.2025",
            "message": "Привет"
            }

    ORDER_DATA_2 = {
            "name": "Мария",
            "surname": "Иванова",
            "address": "Москва, ул. Есенина, 111",
            "phone": "+71234567890",
            "delivery_date": "11.11.2025",
            "message": "Привет!!!"
            }
    
class FaqText():
    correct_FAQ_1_text = 'Сутки — 400 рублей. Оплата курьеру — наличными или картой.'
    correct_FAQ_2_text = 'Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим.' 
    correct_FAQ_3_text = 'Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.'
    correct_FAQ_4_text = 'Только начиная с завтрашнего дня. Но скоро станем расторопнее.'
    correct_FAQ_5_text = 'Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.'
    correct_FAQ_6_text = 'Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится.'
    correct_FAQ_7_text = 'Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.'
    correct_FAQ_8_text = 'Да, обязательно. Всем самокатов! И Москве, и Московской области.'

class OrderSuccessText():
    order_success_text = 'Заказ оформлен'